package by.epam.hw02.tasks;

/*27. Дано значение a. Не используя никаких функций и никаких операций, кроме умножения, 
 * получить значение а^8 за три операции и  а^10 за четыре операции. 
*/

public class Task27 {

	public static void main(String[] args) { 
		
		int a = 2;
		
		//======= за три умножения достигаем a в степени 8 
		int a2 = a*a;
		int a4 = a2*a2;
		int a8 = a4*a4;
		//==============================================
		
		//===== за 4-е достигаем a в степени 10 
		int a10 = a8 * a2;
		//=============================================
		
		System.out.println("a = " + a);
		System.out.printf("1) а в степени 2 = %d\n", a2);
		System.out.printf("2) а в степени 4 = %d\n", a4);
		System.out.printf("3) а в степени 8 = %d\n", a8);
		System.out.printf("4) а в степени 10 = %d\n", a10);

	}

}
